updated architecture graphs
